Documents/РегистрацияСведенийОбОбъектахНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РегистрацияСведенийОбОбъектахНедвижимости</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РеквизитыЗемельныхУчастков</xr:Item>
				<xr:Item>InformationRegister.РеквизитыОбъектовНедвижимости</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыНедвижимостиКромеЗемельныхУчастков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеОбъектаНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НазначенияОбъектовНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтроительствоЗавершено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеЕГРН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетныйАктив</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчетныеАктивы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиОбъектовНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеХарактеристики</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПомещения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПомещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КадастроваяСтоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОКТМО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНалогаНаИмущество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасчетНалогаПоКадастровойСтоимости</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗемельныеУчастки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияЗемельногоУчастка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НазначенияОбъектовНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Площадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРазрешенногоИспользованияЗемельногоУчастка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРазрешенногоИспользованияЗемельныхУчастков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КадастроваяСтоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РегистрацияСведенийОбОбъектахНедвижимости/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбъектыНедвижимостиКромеЗемельныхУчастковПриАктивизацииПоля(Элемент)
	ТД = Элементы.ОбъектыНедвижимостиКромеЗемельныхУчастков.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		ТД.ВидОбъектаНедвижимости = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТД.ОбъектНедвижимости, "ВидОбъектаНедвижимости");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗемельныеУчасткиПриАктивизацииПоля(Элемент)
	ТД = Элементы.ЗемельныеУчастки.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		ТД.ВидОбъектаНедвижимости = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТД.ОбъектНедвижимости, "ВидОбъектаНедвижимости");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьОбъектНедвижимостиНаСервере(ОбъектНедвижимости)
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ДобавитьОбъектНедвижимости(ОбъектНедвижимости);// Вставить содержимое обработчика.
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыНедвижимостиКромеЗемельныхУчастковПриИзменении(Элемент)
	Если Элемент.Имя = "ОбъектыНедвижимостиКромеЗемельныхУчастковОбъектНедвижимости" Тогда
		ТД = Элементы.ОбъектыНедвижимостиКромеЗемельныхУчастков.ТекущиеДанные;
		Если ТД <> Неопределено Тогда
			Если ЗначениеЗаполнено(ТД.ОбъектНедвижимости) Тогда
				ДобавитьОбъектНедвижимостиНаСервере(ТД.ОбъектНедвижимости);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗемельныеУчасткиОбъектНедвижимостиПриИзменении(Элемент)
	Если Элемент.Имя = "ЗемельныеУчасткиОбъектНедвижимости"
		Тогда
		ТД = Элементы.ЗемельныеУчастки.ТекущиеДанные;
		Если ТД <> Неопределено Тогда
			Если ЗначениеЗаполнено(ТД.ОбъектНедвижимости) Тогда
				ДобавитьОбъектНедвижимостиНаСервере(ТД.ОбъектНедвижимости);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЕстьСтрокиОбъектовНедвижимостиКромеЗемельныхУчастков()
	Возврат Объект.ОбъектыНедвижимостиКромеЗемельныхУчастков.Количество() > 0;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЕстьСтрокиОбъектовНедвижимостиКромеЗемельныхУчастков() Тогда
		ЭтотОбъект.ТекущийЭлемент = Элементы.ГруппаОбъектыНедвижимостиКромеЗемельныхУчастков;
	Иначе
		ЭтотОбъект.ТекущийЭлемент = Элементы.ГруппаЗемельныеУчастки;
	КонецЕсли;
КонецПроцедуры
